#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; POSW                     0   xyz         1     NONE   float       
; NORMAL                   0   xyz         2     NONE   float       
; TEXCOORD                 0   xy          3     NONE   float       
; SHADOWPOS                0   xyzw        4     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: de429e1bfe71265a23f526fac1480b04.lld
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSW                     0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
; SHADOWPOS                0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !90)
!1 = !DIFile(filename: "PixelShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !21)
!6 = !{!7, !9, !17}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !5, file: !1, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !5, file: !1, type: !10, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !13)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !5, file: !1, type: !18, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!12, !20, !16}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !13)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !37)
!26 = !{!27, !28, !33}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !25, file: !1, baseType: !8, size: 32, align: 32)
!28 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !25, file: !1, type: !29, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!29 = !DISubroutineType(types: !30)
!30 = !{!12, !31, !16}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!33 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !25, file: !1, type: !34, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!34 = !DISubroutineType(types: !35)
!35 = !{!12, !36, !16}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!37 = !{!22, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!39 = !{!40, !65, !68, !84, !87}
!40 = !DISubprogram(name: "main", scope: !1, file: !1, line: 167, type: !41, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DISubroutineType(types: !42)
!42 = !{!4, !43}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Input", file: !1, line: 134, size: 512, align: 32, elements: !44)
!44 = !{!45, !46, !62, !63, !64}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !43, file: !1, line: 136, baseType: !4, size: 128, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "posW", scope: !43, file: !1, line: 137, baseType: !47, size: 96, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !49, templateParams: !60)
!49 = !{!50, !51, !56}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !48, file: !1, baseType: !8, size: 32, align: 32)
!51 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !48, file: !1, type: !52, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!12, !54, !16}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!56 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !48, file: !1, type: !57, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!12, !59, !16}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !{!22, !61}
!61 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !43, file: !1, line: 138, baseType: !47, size: 96, align: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !43, file: !1, line: 139, baseType: !24, size: 64, align: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "shadowPos", scope: !43, file: !1, line: 140, baseType: !4, size: 128, align: 32, offset: 384)
!65 = !DISubprogram(name: "CalcShadowFactor", linkageName: "\01?CalcShadowFactor@@YAMV?$vector@M$03@@@Z", scope: !1, file: !1, line: 112, type: !66, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!13, !4}
!68 = !DISubprogram(name: "ComputeDirectionalLight", linkageName: "\01?ComputeDirectionalLight@@YA?AV?$vector@M$02@@ULight@@UMaterial@@V1@2@Z", scope: !1, file: !1, line: 52, type: !69, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!47, !71, !79, !47, !47}
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light", file: !1, line: 3, size: 384, align: 32, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !71, file: !1, line: 4, baseType: !47, size: 96, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffStart", scope: !71, file: !1, line: 5, baseType: !13, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !71, file: !1, line: 6, baseType: !47, size: 96, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fallOffEnd", scope: !71, file: !1, line: 7, baseType: !13, size: 32, align: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !71, file: !1, line: 8, baseType: !47, size: 96, align: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "spotPower", scope: !71, file: !1, line: 9, baseType: !13, size: 32, align: 32, offset: 352)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1, line: 12, size: 256, align: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseAlbedo", scope: !79, file: !1, line: 13, baseType: !4, size: 128, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fresnelR0", scope: !79, file: !1, line: 14, baseType: !47, size: 96, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "shininess", scope: !79, file: !1, line: 15, baseType: !13, size: 32, align: 32, offset: 224)
!84 = !DISubprogram(name: "BlinnPhong", linkageName: "\01?BlinnPhong@@YA?AV?$vector@M$02@@V1@000UMaterial@@@Z", scope: !1, file: !1, line: 35, type: !85, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!47, !47, !47, !47, !47, !79}
!87 = !DISubprogram(name: "SchlickFresnel", linkageName: "\01?SchlickFresnel@@YA?AV?$vector@M$02@@V1@00@Z", scope: !1, file: !1, line: 25, type: !88, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!47, !47, !47, !47}
!90 = !{!91, !108, !112, !113}
!91 = !DIGlobalVariable(name: "shadowMap", linkageName: "\01?shadowMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 109, type: !92, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?shadowMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!92 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 109, size: 160, align: 32, elements: !93, templateParams: !106)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !92, file: !1, line: 109, baseType: !5, size: 128, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "mips", scope: !92, file: !1, line: 109, baseType: !96, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_type", scope: !92, file: !1, line: 109, size: 32, align: 32, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !96, file: !1, line: 109, baseType: !16, size: 32, align: 32)
!99 = !DISubprogram(name: "operator[]", linkageName: "\01??Amips_type@?$Texture2D@V?$vector@M$03@@@@QBA$$QAVmips_slice_type@1@I@Z", scope: !96, file: !1, line: 109, type: !100, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !104, !16}
!102 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_slice_type", scope: !92, file: !1, line: 109, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "element", type: !5)
!108 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !1, line: 110, type: !109, isLocal: false, isDefinition: true, variable: %struct.SamplerComparisonState* @"\01?shadowSampler@@3USamplerComparisonState@@A")
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 110, size: 32, align: 32, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !109, file: !1, line: 110, baseType: !8, size: 32, align: 32, flags: DIFlagPrivate)
!112 = !DIGlobalVariable(name: "tex", linkageName: "\01?tex@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 161, type: !92, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?tex@@3V?$Texture2D@V?$vector@M$03@@@@A")
!113 = !DIGlobalVariable(name: "samplerState", linkageName: "\01?samplerState@@3USamplerState@@A", scope: !0, file: !1, line: 162, type: !114, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?samplerState@@3USamplerState@@A")
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 162, size: 32, align: 32, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !114, file: !1, line: 162, baseType: !8, size: 32, align: 32, flags: DIFlagPrivate)
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{!"dxc 1.2"}
